Repository: TreantProtectorGo/Daily-Sum
Catalog: Flux/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant

# settings.clearData.message
source: You cannot undo this action.
zh_hans: 此操作无法撤销。
zh_hant: 此操作無法復原。

# settings.clearData.title
source: Clear all data?
zh_hans: 要清除所有数据吗？
zh_hant: 要清除所有資料嗎？

# settings.cloudSync
source: iCloud Sync
zh_hans: iCloud 同步
zh_hant: iCloud 同步

# settings.cloudSync.enable
source: Enable iCloud Sync
zh_hans: 启用 iCloud 同步
zh_hant: 啟用 iCloud 同步

# settings.cloudSync.message.off
source: Sync is currently off.
zh_hans: 同步目前已关闭。
zh_hant: 同步目前已關閉。

# settings.cloudSync.message.on
source: Changes sync through iCloud.
zh_hans: 更改会通过 iCloud 同步。
zh_hant: 更改會透過 iCloud 同步。

# settings.cloudSync.message.signInRequired
source: Sign in to iCloud in Settings, then return here to enable sync.
zh_hans: 请先在“设置”中登录 iCloud，然后返回此处启用同步。
zh_hant: 請先在「設定」登入 iCloud，再返回此處啟用同步。

# settings.cloudSync.status.needsAttention
source: Needs Attention
zh_hans: 待处理
zh_hant: 待處理

# settings.cloudSync.status.off
source: Off
zh_hans: 关闭
zh_hant: 關閉

# settings.cloudSync.status.on
source: On
zh_hans: 开启
zh_hant: 開啟

# settings.csvExport.action
source: Export Transactions CSV
zh_hans: 导出交易 CSV
zh_hant: 匯出交易 CSV

# settings.csvExport.error
source: Unable to export transactions. Please try again.
zh_hans: 无法导出交易，请再试一次。
zh_hant: 無法匯出交易，請再試一次。

# settings.csvExport.footer
source: Exports all transactions with original and converted amounts.
zh_hans: 导出所有交易，并包括原始金额和换算金额。
zh_hant: 匯出所有交易，並包括原始金額及換算金額。

# settings.currency
source: Currency
zh_hans: 货币
zh_hant: 貨幣

# settings.dataContinuity
source: Sync & Backup
zh_hans: 同步与备份
zh_hant: 同步與備份

# settings.dataManagement
source: Data Management
zh_hans: 数据管理
zh_hant: 資料管理

# settings.dataSummary
source: Data Summary
zh_hans: 数据摘要
zh_hant: 資料摘要

# settings.defaultAccount
source: Default Account
zh_hans: 默认账户
zh_hant: 預設帳戶

# settings.defaultAccount.none
source: None
zh_hans: 无
zh_hant: 無

# settings.defaultCurrency
source: Default Currency
zh_hans: 默认货币
zh_hant: 預設貨幣

# settings.defaultCurrency.short
source: Default
zh_hans: 默认
zh_hant: 預設

# settings.defaultLanguage
source: App Language
zh_hans: 应用语言
zh_hant: App 語言

# settings.defaultLaunchPage
source: Default Page
zh_hans: 默认页面
zh_hant: 預設頁面

# settings.defaultLaunchPage.footer
source: Choose which tab opens when you launch Daily Sum.
zh_hans: 选择启动日常账时打开的标签页。
zh_hant: 選擇啟動日常帳時開啟的分頁。

# settings.exchangeRate.configuration
source: Foreign Currency Mode
zh_hans: 外币模式
zh_hant: 外幣模式

# settings.exchangeRate.configuration.automatic
source: Automatic
zh_hans: 自动
zh_hant: 自動

# settings.exchangeRate.configuration.footer
source: When off, new transactions will not default to foreign currency. When on, Automatic follows your location; Manual uses your selected currency.
zh_hans: 关闭后，新交易不会默认使用外币。 自动模式按所在地区设置货币；手动模式沿用你选择的货币。
zh_hant: 關閉後，新交易不會預設使用外幣。 自動模式按所在地區設定貨幣；手動模式則沿用你選定的貨幣。

# settings.exchangeRate.configuration.manual
source: Manual
zh_hans: 手动
zh_hant: 手動

# settings.exchangeRate.configuration.mode
source: Mode
zh_hans: 模式
zh_hant: 模式

# settings.exchangeRate.configuration.summary.automatic
source: Automatic · %@
zh_hans: 自动 · %@
zh_hant: 自動 · %@

# settings.exchangeRate.configuration.summary.manual
source: Manual · %@
zh_hans: 手动 · %@
zh_hant: 手動 · %@

# settings.exchangeRate.configuration.summary.manual.unset
source: Manual (Not Set)
zh_hans: 手动（未设置）
zh_hant: 手動（未設定）

# settings.exchangeRate.configuration.title
source: Foreign Currency Settings
zh_hans: 外币设置
zh_hant: 外幣設定

# settings.exchangeRate.configuration.toggle
source: Enable Foreign Currency Mode
zh_hans: 启用外币模式
zh_hant: 啟用外幣模式

# settings.exchangeRate.currentTravelCurrency
source: Current Foreign Currency
zh_hans: 目前外币
zh_hant: 目前外幣

# settings.exchangeRate.currentTravelCurrency.none
source: Inactive
zh_hans: 未启用
zh_hant: 未啟用

# settings.exchangeRate.detectedCurrency
source: Detected Currency
zh_hans: 检测到的货币
zh_hant: 偵測到的貨幣

# settings.exchangeRate.detectedCurrency.none
source: Not Detected
zh_hans: 未检测到
zh_hant: 未偵測到

# settings.exchangeRate.lastUpdated
source: Last Updated
zh_hans: 上次更新
zh_hant: 上次更新

# settings.exchangeRate.locationNotEnabled
source: Location Not Enabled
zh_hans: 未启用定位
zh_hant: 未啟用定位

# settings.exchangeRate.manualTravelCurrency
source: Selected Foreign Currency
zh_hans: 所选外币
zh_hant: 所選外幣

# settings.exchangeRate.manualTravelCurrency.auto
source: Use Detected Currency
zh_hans: 使用定位货币
zh_hant: 使用定位貨幣

# settings.exchangeRate.manualTravelCurrency.placeholder
source: Select Currency
zh_hans: 选择货币
zh_hant: 選擇貨幣

# settings.exchangeRate.never
source: Never
zh_hans: 从未
zh_hant: 從未

# settings.exchangeRate.openCalculator
source: Exchange Calculator
zh_hans: 汇率计算器
zh_hant: 匯率計算器

# settings.exchangeRate.refreshLocation
source: Use Location to Update
zh_hans: 使用定位更新
zh_hant: 使用定位更新

# settings.exchangeRate.refreshNow
source: Refresh Now
zh_hans: 立即更新
zh_hant: 立即更新

# settings.exchangeRate.source
source: Source
zh_hans: 来源
zh_hant: 來源

# settings.exchangeRate.staleWarning
source: Rates may be outdated. Refresh to improve accuracy.
zh_hans: 汇率可能已过期。请刷新以提高准确性。
zh_hant: 匯率可能已過期。請重新整理以提高準確度。

# settings.exchangeRate.travelSection
source: Foreign Currency
zh_hans: 外币
zh_hant: 外幣

# settings.exchangeRate.useLocationDefaults
source: Automatically Detect Foreign Currency
zh_hans: 自动检测外币
zh_hant: 自動偵測外幣

# settings.exchangeRate.useLocationDefaults.footer
source: Detected currency follows your location. Manual travel currency stays active until you clear it.
zh_hans: 自动模式会按你所在位置更新货币。手动设置后，所选货币会一直生效，直至你切回自动模式。
zh_hant: 自動模式會按你所在位置更新貨幣。手動設定後，所選貨幣會一直生效，直至你切回自動模式。

# settings.exchangeRates
source: Exchange Rates
zh_hans: 汇率
zh_hant: 匯率

# settings.language
source: Language
zh_hans: 语言
zh_hant: 語言

# settings.language.english
source: English
zh_hans: 英语
zh_hant: 英語

# settings.language.simplifiedChinese
source: Simplified Chinese
zh_hans: 简体中文
zh_hant: 簡體中文

# settings.language.system
source: System Default
zh_hans: 系统默认值
zh_hant: 系統預設值

# settings.language.traditionalChinese
source: Traditional Chinese
zh_hans: 繁体中文
zh_hant: 繁體中文

# settings.options
source: Options
zh_hans: 选项
zh_hant: 選項

# settings.privacyPolicy.title
source: Privacy Policy
zh_hans: 隐私政策
zh_hant: 私隱政策

# settings.rememberLastAccount
source: Remember Last Used Account
zh_hans: 记住上次使用的账户
zh_hant: 記住上次使用的帳戶

# settings.rememberLastAccount.footer
source: When enabled, Add Transaction opens with your last used account. Otherwise it uses Default Account.
zh_hans: 添加交易时会预先选择上次使用的账户；否则选择默认账户。
zh_hant: 新增交易時會預先選取上次使用的帳戶；否則選取預設帳戶。

# settings.reminders
source: Notifications
zh_hans: 通知
zh_hant: 通知

# settings.reminders.denied
source: Denied
zh_hans: 已拒绝
zh_hant: 已關閉

# settings.reminders.enable
source: Enable Notifications
zh_hans: 启用通知
zh_hant: 啟用通知

# settings.reminders.enabled
source: Enabled
zh_hans: 已启用
zh_hant: 已啟用

# settings.reminders.notDetermined
source: Not Requested
zh_hans: 未请求
zh_hant: 尚未要求

# settings.reminders.openSettings
source: Open iOS Settings
zh_hans: 打开 iOS“设置”
zh_hant: 開啟 iOS「設定」

# settings.reminders.status
source: All Notifications
zh_hans: 所有通知
zh_hant: 所有通知

# settings.reminders.unknown
source: Unknown
zh_hans: 未知
zh_hant: 未知

# settings.reports
source: Reports
zh_hans: 报告
zh_hant: 報告

# settings.reports.categoryRows
source: Category Rows
zh_hans: 类别显示数量
zh_hant: 類別顯示數目

# settings.reports.categoryRows.footer
source: Controls how many category rows are shown by default in Reports before you tap Show more.
zh_hans: 设置“报表”默认显示的类别数量；点击“显示更多”可展开其余类别。
zh_hant: 設定「報表」預設顯示的類別數目；點按「顯示更多」可展開其餘類別。

# settings.startup
source: Startup
zh_hans: 启动
zh_hant: 啟動

# settings.theme
source: Appearance
zh_hans: 外观
zh_hant: 外觀

# settings.theme.dark
source: Dark
zh_hans: 深色
zh_hant: 深色

# settings.theme.light
source: Light
zh_hans: 浅色
zh_hant: 淺色

# settings.theme.system
source: System
zh_hans: 跟随系统
zh_hant: 跟隨系統

# settings.title
source: Settings
zh_hans: 设置
zh_hant: 設定

# settings.transactionDefaults
source: Transaction Defaults
zh_hans: 交易默认
zh_hant: 交易預設

# settings.transactionDefaults.footer
source: Remember Last Used Account is on by default. Turn on Auto-Open Account After Category if you want the account picker to open immediately after choosing a category.
zh_hans: 如需选择类别后立即显示账户选择器，请启用“选择类别后自动显示账户选择器”。
zh_hant: 如想選定類別後立即顯示帳戶選擇器，請啟用「選定類別後自動顯示帳戶選擇器」。

# settings.transactions
source: Transactions
zh_hans: 交易
zh_hant: 交易

# settings.version
source: Version
zh_hans: 版本
zh_hant: 版本

# symbol.choose
source: Choose Symbol
zh_hans: 选择符号
zh_hant: 選擇符號

# symbol.manual.help
source: Paste any Apple SF Symbol name here.
zh_hans: 在此粘贴任意 Apple SF Symbol 名称。
zh_hant: 在此貼上任何 Apple SF Symbol 名稱。

# symbol.manual.invalid
source: This SF Symbol is not available on this iOS version.
zh_hans: 此 SF Symbol 不适用于当前 iOS 版本。
zh_hant: 此 SF Symbol 不適用於目前 iOS 版本。

# symbol.manual.placeholder
source: Enter any SF Symbol name
zh_hans: 输入任意 SF Symbol 名称
zh_hant: 輸入任何 SF Symbol 名稱

# symbol.search
source: Search SF Symbols
zh_hans: 搜索 SF Symbols
zh_hant: 搜尋 SF Symbols

# tab.dashboard
source: Home
zh_hans: 主页
zh_hant: 主頁

# tab.reports
source: Reports
zh_hans: 报告
zh_hant: 報告

# tab.search
source: Search
zh_hans: 搜索
zh_hant: 搜尋

# tab.settings
source: Settings
zh_hans: 设置
zh_hant: 設定

# tab.transactions
source: Transactions
zh_hans: 交易
zh_hant: 交易

# transaction.account
source: Account
zh_hans: 账户
zh_hant: 帳戶

# transaction.add
source: Add Transaction
zh_hans: 添加交易
zh_hant: 新增交易

# transaction.amount
source: Amount
zh_hans: 金额
zh_hant: 金額

# transaction.count.one
source: %lld transaction
zh_hans: %lld 笔交易
zh_hant: %lld 筆交易

# transaction.count.other
source: %lld transactions
zh_hans: %lld 笔交易
zh_hant: %lld 筆交易

# transaction.date
source: Date
zh_hans: 日期
zh_hant: 日期

# transaction.deleteScheduledFuture.keep
source: Keep Subscription
zh_hans: 保留订阅
zh_hant: 保留訂閱

# transaction.deleteScheduledFuture.message
source: Skip this occurrence or stop this subscription?
zh_hans: 要跳过本期，还是停止此订阅？
zh_hant: 要跳過本期，還是停止此訂閱？

# transaction.deleteScheduledFuture.skip
source: Skip this occurrence
zh_hans: 跳过本期
zh_hant: 跳過本期

# transaction.deleteScheduledFuture.stop
source: Stop this subscription
zh_hans: 停止订阅
zh_hant: 停止訂閱

# transaction.deleteScheduledFuture.title
source: This is a subscription transaction
zh_hans: 这是订阅交易
zh_hant: 此為訂閱交易

# transaction.deleteScheduledSource.deleteAll
source: Delete entire subscription
zh_hans: 删除整个订阅
zh_hant: 刪除整個訂閱

# transaction.deleteScheduledSource.deleteOne
source: Delete only this transaction
zh_hans: 只删除这笔交易
zh_hant: 只刪除此交易

# transaction.deleteScheduledSource.keep
source: Keep Transaction
zh_hans: 保留交易
zh_hant: 保留交易

# transaction.deleteScheduledSource.message
source: Deleting this source transaction will delete the entire subscription.
zh_hans: 删除此来源交易会一并删除整个订阅。
zh_hant: 刪除此來源交易會一併刪除整個訂閱。

# transaction.details
source: Details
zh_hans: 详情
zh_hant: 詳情

# transaction.edit.expense
source: Edit Expense
zh_hans: 编辑支出
zh_hant: 編輯支出

# transaction.edit.income
source: Edit Income
zh_hans: 编辑收入
zh_hant: 編輯收入

# transaction.noAccounts
source: No accounts available. Create an account first.
zh_hans: 没有可用账户。请先创建账户。
zh_hant: 沒有可用帳戶。請先建立帳戶。

# transaction.notes
source: Notes
zh_hans: 备注
zh_hant: 備註

# transaction.notes.placeholder
source: Add notes...
zh_hans: 添加备注…
zh_hant: 新增備註…

# transaction.schedule.dueDay
source: Due Day
zh_hans: 到期日
zh_hant: 到期日

# transaction.schedule.footer
source: Subscription expenses are auto-generated up to 31 days ahead.
zh_hans: 系统会提前生成未来 31 天的订阅支出交易。
zh_hant: 系統會預先建立未來 31 天的訂閱支出交易。

# transaction.schedule.header
source: Entry Type
zh_hans: 记录方式
zh_hant: 記錄方式

# transaction.schedule.installment
source: Installment
zh_hans: 分期
zh_hant: 分期

# transaction.schedule.installment.progress
source: Installment
zh_hans: 分期
zh_hant: 分期

# transaction.schedule.installment.totalCount
source: Installments
zh_hans: 分期期数
zh_hant: 分期期數

# transaction.schedule.mode
source: Schedule
zh_hans: 计划
zh_hant: 排程

# transaction.schedule.oneTime
source: One-time
zh_hans: 单次
zh_hant: 單次

# transaction.schedule.recurring
source: Recurring
zh_hans: 订阅
zh_hant: 訂閱

# transaction.schedule.reminder
source: Reminder
zh_hans: 提醒
zh_hant: 提醒

# transaction.schedule.reminder.daysBefore
source: day(s) before
zh_hans: 天前
zh_hant: 天前

# transaction.schedule.reminder.sameDay
source: Same day
zh_hans: 当天
zh_hant: 當天

# transaction.schedule.upcoming
source: Upcoming
zh_hans: 即将到期
zh_hant: 即將到期

# transaction.selectAccount
source: Select Account
zh_hans: 选择账户
zh_hant: 選擇帳戶

# transaction.travel
source: Foreign Currency Transaction
zh_hans: 外币交易
zh_hant: 外幣交易

# transaction.travel.badge
source: Foreign
zh_hans: 外币
zh_hant: 外幣

# transaction.travel.chargedAs
source: Charged as
zh_hans: 入账为
zh_hant: 入帳為

# transaction.travel.modeHelper
source: Foreign currency mode on — amount is entered in %@
zh_hans: 外币模式已开启，金额会以 %@ 输入
zh_hant: 外幣模式已開啟，金額會以 %@ 輸入

# transaction.type
source: Type
zh_hans: 类型
zh_hant: 類型

# transaction.type.expense
source: Expense
zh_hans: 支出
zh_hant: 支出

# transaction.type.income
source: Income
zh_hans: 收入
zh_hant: 收入

# transaction.uncategorized
source: Uncategorized
zh_hans: 未分类
zh_hant: 未分類

# transaction.upcomingHint.action
source: Show
zh_hans: 显示
zh_hant: 顯示

# transaction.upcomingHint.action.hide
source: Hide
zh_hans: 隐藏
zh_hant: 隱藏

# transaction.upcomingHint.subtitle
source: %lld due in the next %lld days • Next %@
zh_hans: 未来 %2$lld 天有 %1$lld 笔 • 下一笔 %3$@
zh_hant: 未來 %2$lld 天有 %1$lld 筆 • 下一筆 %3$@

# transaction.upcomingHint.title
source: Upcoming subscriptions
zh_hans: 即将到期的订阅
zh_hant: 即將到期的訂閱

# transactions.clearFilters
source: Clear Filters
zh_hans: 清除筛选条件
zh_hant: 清除篩選條件

# transactions.noResults.message
source: Try adjusting your filters or search terms.
zh_hans: 请调整筛选条件或搜索词。
zh_hant: 請調整篩選條件或搜尋字詞。

# transactions.noResults.title
source: No Results
zh_hans: 没有结果
zh_hant: 沒有結果

# transactions.title
source: Transactions
zh_hans: 交易
zh_hant: 交易

source: Trend Segment
zh_hans: 趋势区段
zh_hant: 走勢區段

source: Zero
zh_hans: 零
zh_hant: 零
